bdring/FluidNC/FluidNC/esp32/fnc_idf_uart_5_5_4.c
esp_err_t fnc_uart_enable_tx_intr(uart_port_t uart_num, int enable, int thresh)
{
    (void)enable;
    ESP_RETURN_ON_FALSE((uart_num < UART_NUM_MAX), ESP_FAIL, UART_TAG, "uart_num error");
    ESP_RETURN_ON_FALSE((thresh < FNC_UART_HW_FIFO_LEN(uart_num)), ESP_FAIL, UART_TAG, "empty intr threshold error");
    uart_hal_clr_intsts_mask(&(uart_context[uart_num].hal), UART_INTR_TXFIFO_EMPTY);
    UART_ENTER_CRITICAL(&(uart_context[uart_num].spinlock));
    if (thresh != -1) {
        uart_hal_set_txfifo_empty_thr(&(uart_context[uart_num].hal), thresh);
    }
    uart_hal_ena_intr_mask(&(uart_context[uart_num].hal), UART_INTR_TXFIFO_EMPTY);
    UART_EXIT_CRITICAL(&(uart_context[uart_num].spinlock));
    return ESP_OK;
}

static bool fnc_uart_try_set_iomux_pin(uart_port_t uart_num, int io_num, uint32_t idx)
{
    /* Store a pointer to the default pin, to optimize access to its fields. */
    const uart_periph_sig_t *upin = &uart_periph_signal[uart_num].pins[idx];

    /* In theory, if default_gpio is -1, iomux_func should also be -1, but
     * let's be safe and test both. */
    if (upin->iomux_func == -1 || upin->default_gpio == -1 || upin->default_gpio != io_num) {
        return false;
    }

    /* Assign the correct funct to the GPIO. */
    assert(upin->iomux_func != -1);
    if (uart_num < SOC_UART_HP_NUM) {
        if (upin->input) {
            gpio_iomux_input(io_num, upin->iomux_func, upin->signal);
        } else {
            gpio_iomux_output(io_num, upin->iomux_func);
        }
    }
#if (SOC_UART_LP_NUM >= 1) && (SOC_RTCIO_PIN_COUNT >= 1)
    else {
        if (upin->input) {
            rtc_gpio_set_direction(io_num, RTC_GPIO_MODE_INPUT_ONLY);
        } else {
            rtc_gpio_set_direction(io_num, RTC_GPIO_MODE_OUTPUT_ONLY);
        }
        rtc_gpio_init(io_num);
        rtc_gpio_iomux_func_sel(io_num, upin->iomux_func);
        // undo the workaround done in fnc_uart_module_enable for RX pin
#if !SOC_LP_GPIO_MATRIX_SUPPORTED
        if (upin->input) {
            gpio_pullup_dis(io_num);
        }
#endif
    }
#endif

    return true;
}

static void fnc_uart_release_pin(uart_port_t uart_num, bool release_tx, bool release_rx, bool release_rts, bool release_cts)
{
    if (uart_num >= UART_NUM_MAX) {
        return;
    }

    uint32_t released_io_mask = 0;
    if (release_tx && uart_context[uart_num].tx_io_num >= 0) {
        gpio_output_disable(uart_context[uart_num].tx_io_num);
#if (SOC_UART_LP_NUM >= 1)
        if (!(uart_num < SOC_UART_HP_NUM)) {
            rtc_gpio_deinit(uart_context[uart_num].tx_io_num);
        }
#endif
#if CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND || CONFIG_PM_SLP_DISABLE_GPIO
        gpio_sleep_sel_en(uart_context[uart_num].tx_io_num); // re-enable the switch to the sleep configuration to save power consumption
#endif

        released_io_mask |= BIT64(uart_context[uart_num].tx_io_num);
        uart_context[uart_num].tx_io_num = -1;
    }

    if (release_rx && uart_context[uart_num].rx_io_num >= 0) {
        if (uart_num < SOC_UART_HP_NUM) {
            esp_rom_gpio_connect_in_signal(GPIO_MATRIX_CONST_ONE_INPUT, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), false);
        }
#if (SOC_UART_LP_NUM >= 1)
        else {
#if SOC_LP_GPIO_MATRIX_SUPPORTED
            lp_gpio_connect_in_signal(LP_GPIO_MATRIX_CONST_ONE_INPUT, UART_PERIPH_SIGNAL(uart_num, SOC_UART_RX_PIN_IDX), false);
#endif
            rtc_gpio_deinit(uart_context[uart_num].rx_io_num);
        }
#endif
#if CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND || CONFIG_PM_SLP_DISABLE_GPIO
        gpio_sleep_sel_en(uart_context[uart_num].rx_io_num); // re-enable the switch to the sleep configuration to save power consumption
#endif

        released_io_mask |= BIT64(uart_context[uart_num].rx_io_num);
        uart_context[uart_num].rx_io_num = -1;
    }

    if (release_rts && uart_context[uart_num].rts_io_num >= 0) {
        gpio_output_disable(uart_context[uart_num].rts_io_num);
#if (SOC_UART_LP_NUM >= 1)
        if (!(uart_num < SOC_UART_HP_NUM)) {
            rtc_gpio_deinit(uart_context[uart_num].rts_io_num);
        }
#endif

        released_io_mask |= BIT64(uart_context[uart_num].rts_io_num);
        uart_context[uart_num].rts_io_num = -1;
    }

    if (release_cts && uart_context[uart_num].cts_io_num >= 0) {
        if (uart_num < SOC_UART_HP_NUM) {
            esp_rom_gpio_connect_in_signal(GPIO_MATRIX_CONST_ZERO_INPUT, UART_PERIPH_SIGNAL(uart_num, SOC_UART_CTS_PIN_IDX), false);
        }
#if (SOC_UART_LP_NUM >= 1)
        else {
#if SOC_LP_GPIO_MATRIX_SUPPORTED
            lp_gpio_connect_in_signal(LP_GPIO_MATRIX_CONST_ZERO_INPUT, UART_PERIPH_SIGNAL(uart_num, SOC_UART_CTS_PIN_IDX), false);
#endif
            rtc_gpio_deinit(uart_context[uart_num].cts_io_num);
        }
#endif

        released_io_mask |= BIT64(uart_context[uart_num].cts_io_num);
        uart_context[uart_num].cts_io_num = -1;
    }

    esp_gpio_revoke(uart_context[uart_num].io_reserved_mask & released_io_mask);
    uart_context[uart_num].io_reserved_mask &= ~released_io_mask;
}

esp_err_t fnc_uart_set_pin(uart_port_t uart_num, int tx_io_num, int rx_io_num, int rts_io_num, int cts_io_num)
{
    ESP_RETURN_ON_FALSE((uart_num >= 0), ESP_FAIL, UART_TAG, "uart_num error");
    ESP_RETURN_ON_FALSE((uart_num < UART_NUM_MAX), ESP_FAIL, UART_TAG, "uart_num error");
    if (uart_num < SOC_UART_HP_NUM) {
        ESP_RETURN_ON_FALSE((tx_io_num < 0 || (GPIO_IS_VALID_OUTPUT_GPIO(tx_io_num))), ESP_FAIL, UART_TAG, "tx_io_num error");
        ESP_RETURN_ON_FALSE((rx_io_num < 0 || (GPIO_IS_VALID_GPIO(rx_io_num))), ESP_FAIL, UART_TAG, "rx_io_num error");
        ESP_RETURN_ON_FALSE((rts_io_num < 0 || (GPIO_IS_VALID_OUTPUT_GPIO(rts_io_num))), ESP_FAIL, UART_TAG, "rts_io_num error");
        ESP_RETURN_ON_FALSE((cts_io_num < 0 || (GPIO_IS_VALID_GPIO(cts_io_num))), ESP_FAIL, UART_TAG, "cts_io_num error");
    }
#if (SOC_UART_LP_NUM >= 1)
    else { // LP_UART IO check

#if !SOC_LP_GPIO_MATRIX_SUPPORTED
        const uart_periph_sig_t *pins = uart_periph_signal[uart_num].pins;
        // LP_UART has its fixed IOs
        ESP_RETURN_ON_FALSE((tx_io_num < 0 || (tx_io_num == pins[SOC_UART_TX_PIN_IDX].default_gpio)), ESP_FAIL, UART_TAG, "tx_io_num error");
        ESP_RETURN_ON_FALSE((rx_io_num < 0 || (rx_io_num == pins[SOC_UART_RX_PIN_IDX].default_gpio)), ESP_FAIL, UART_TAG, "rx_io_num error");
        ESP_RETURN_ON_FALSE((rts_io_num < 0 || (rts_io_num == pins[SOC_UART_RTS_PIN_IDX].default_gpio)), ESP_FAIL, UART_TAG, "rts_io_num error");
        ESP_RETURN_ON_FALSE((cts_io_num < 0 || (cts_io_num == pins[SOC_UART_CTS_PIN_IDX].default_gpio)), ESP_FAIL, UART_TAG, "cts_io_num error");
#else
        // LP_UART signals can be routed to any LP_IOs
        ESP_RETURN_ON_FALSE((tx_io_num < 0 || rtc_gpio_is_valid_gpio(tx_io_num)), ESP_FAIL, UART_TAG, "tx_io_num error");
        ESP_RETURN_ON_FALSE((rx_io_num < 0 || rtc_gpio_is_valid_gpio(rx_io_num)), ESP_FAIL, UART_TAG, "rx_io_num error");
        ESP_RETURN_ON_FALSE((rts_io_num < 0 || rtc_gpio_is_valid_gpio(rts_io_num)), ESP_FAIL, UART_TAG, "rts_io_num error");
        ESP_RETURN_ON_FALSE((cts_io_num < 0 || rtc_gpio_is_valid_gpio(cts_io_num)), ESP_FAIL, UART_TAG, "cts_io_num error");

#endif  // SOC_LP_GPIO_MATRIX_SUPPORTED
    }
#endif

    // First, release previously configured IOs if there is
    fnc_uart_release_pin(uart_num, (tx_io_num >= 0), (rx_io_num >= 0), (rts_io_num >= 0), (cts_io_num >= 0));

