bdring/FluidNC/FluidNC/esp32/fnc_idf_uart_5_5_4.c
int fnc_uart_write_bytes(uart_port_t uart_num, const void *src, size_t size)
{
    ESP_RETURN_ON_FALSE((uart_num < UART_NUM_MAX), (-1), UART_TAG, "uart_num error");
    ESP_RETURN_ON_FALSE((p_uart_obj[uart_num] != NULL), (-1), UART_TAG, "uart driver error");
    ESP_RETURN_ON_FALSE(src, (-1), UART_TAG, "buffer null");
    return fnc_uart_tx_all(uart_num, src, size, 0, 0);
}

int fnc_uart_write_bytes_with_break(uart_port_t uart_num, const void *src, size_t size, int brk_len)
{
    ESP_RETURN_ON_FALSE((uart_num < UART_NUM_MAX), (-1), UART_TAG, "uart_num error");
    ESP_RETURN_ON_FALSE((p_uart_obj[uart_num]), (-1), UART_TAG, "uart driver error");
    ESP_RETURN_ON_FALSE((size > 0), (-1), UART_TAG, "uart size error");
    ESP_RETURN_ON_FALSE((src), (-1), UART_TAG, "uart data null");
    ESP_RETURN_ON_FALSE((brk_len > 0 && brk_len < 256), (-1), UART_TAG, "break_num error");
    return fnc_uart_tx_all(uart_num, src, size, 1, brk_len);
}

static bool fnc_uart_check_buf_full(uart_port_t uart_num)
{
    if (p_uart_obj[uart_num]->rx_buffer_full_flg) {
        BaseType_t res = xRingbufferSend(p_uart_obj[uart_num]->rx_ring_buf, p_uart_obj[uart_num]->rx_data_buf, p_uart_obj[uart_num]->rx_stash_len, 0);
        if (res == pdTRUE) {
            UART_ENTER_CRITICAL(&(uart_context[uart_num].spinlock));
            p_uart_obj[uart_num]->rx_buffered_len += p_uart_obj[uart_num]->rx_stash_len;
            p_uart_obj[uart_num]->rx_buffer_full_flg = false;
            UART_EXIT_CRITICAL(&(uart_context[uart_num].spinlock));
            /* Only re-activate UART_INTR_RXFIFO_TOUT or UART_INTR_RXFIFO_FULL
             * interrupts if they were NOT explicitly disabled by the user. */
            fnc_uart_reenable_intr_mask(p_uart_obj[uart_num]->uart_num, UART_INTR_RXFIFO_TOUT | UART_INTR_RXFIFO_FULL);
            return true;
        }
    }
    return false;
}

int fnc_uart_read_bytes(uart_port_t uart_num, void *buf, uint32_t length, TickType_t ticks_to_wait)
{
    ESP_RETURN_ON_FALSE((uart_num < UART_NUM_MAX), (-1), UART_TAG, "uart_num error");
    ESP_RETURN_ON_FALSE((buf), (-1), UART_TAG, "uart data null");
    ESP_RETURN_ON_FALSE((p_uart_obj[uart_num]), (-1), UART_TAG, "uart driver error");
    uint8_t *data = NULL;
    size_t size = 0;
    size_t copy_len = 0;
    if (xSemaphoreTake(p_uart_obj[uart_num]->rx_mux, (TickType_t)ticks_to_wait) != pdTRUE) {
        return -1;
    }
    while (length) {
        data = (uint8_t *) xRingbufferReceiveUpTo(p_uart_obj[uart_num]->rx_ring_buf, &size, (TickType_t) ticks_to_wait, length);
        if (!data) {
            // When using dual cores, `rx_buffer_full_flg` may read and write on different cores at same time,
            // which may lose synchronization. So we also need to call `fnc_uart_check_buf_full` once when ringbuffer is empty
            // to solve the possible asynchronous issues.
            if (fnc_uart_check_buf_full(uart_num)) {
                // This condition will never be true if `fnc_uart_read_bytes`
                // and `fnc_uart_rx_intr_handler_default` are scheduled on the same core.
                continue;
            } else {
                // Timeout while not fetched all requested length
                break;
            }
        }
        memcpy((uint8_t *)buf + copy_len, data, size);
        UART_ENTER_CRITICAL(&(uart_context[uart_num].spinlock));
        p_uart_obj[uart_num]->rx_buffered_len -= size;
        fnc_uart_pattern_queue_update(uart_num, size);
        UART_EXIT_CRITICAL(&(uart_context[uart_num].spinlock));
        copy_len += size;
        length -= size;
        vRingbufferReturnItem(p_uart_obj[uart_num]->rx_ring_buf, data);
        fnc_uart_check_buf_full(uart_num);
    }

    xSemaphoreGive(p_uart_obj[uart_num]->rx_mux);
    return copy_len;
}

esp_err_t fnc_uart_get_buffered_data_len(uart_port_t uart_num, size_t *size)
{
    ESP_RETURN_ON_FALSE((uart_num < UART_NUM_MAX), ESP_FAIL, UART_TAG, "uart_num error");
    ESP_RETURN_ON_FALSE((p_uart_obj[uart_num]), ESP_FAIL, UART_TAG, "uart driver error");
    UART_ENTER_CRITICAL(&(uart_context[uart_num].spinlock));
    *size = p_uart_obj[uart_num]->rx_buffered_len;
    UART_EXIT_CRITICAL(&(uart_context[uart_num].spinlock));
    return ESP_OK;
}

esp_err_t fnc_uart_get_tx_buffer_free_size(uart_port_t uart_num, size_t *size)
{
    ESP_RETURN_ON_FALSE((uart_num < UART_NUM_MAX), ESP_ERR_INVALID_ARG, UART_TAG, "uart_num error");
    ESP_RETURN_ON_FALSE((p_uart_obj[uart_num]), ESP_ERR_INVALID_ARG, UART_TAG, "uart driver error");
    ESP_RETURN_ON_FALSE((size != NULL), ESP_ERR_INVALID_ARG, UART_TAG, "arg pointer is NULL");

    // If tx buffer is disabled or ring buffer is full, overall enqueueable payload is 0
    if (p_uart_obj[uart_num]->tx_buf_size == 0 || xRingbufferGetCurFreeSize(p_uart_obj[uart_num]->tx_ring_buf) == 0) {
        *size = 0;
        return ESP_OK;
    }

    // Tight conservative bound for NOSPLIT ring buffer overall enqueueable payload across up to two segments
    const size_t RINGBUF_ITEM_HDR_SIZE = 8; // per public ringbuf API docs

    // Per-item cap in current state and basis to infer minimal buffer size
    size_t max_item = xRingbufferGetMaxItemSize(p_uart_obj[uart_num]->tx_ring_buf);

    // Get current ring buffer pointer offsets and items waiting to detect empty
    UBaseType_t off_free = 0;
    UBaseType_t off_acq = 0;
    UBaseType_t items_waiting = 0;
    vRingbufferGetInfo(p_uart_obj[uart_num]->tx_ring_buf, &off_free, NULL, NULL, &off_acq, &items_waiting);

    // Minimal possible total buffer size for NOSPLIT: see ringbuf initialization logic
    // xMaxItemSize = ALIGN4(xSize/2) - header => xSize_min = 2 * (xMaxItemSize + header - up_to_3_alignment)
    size_t buf_size_min = 2 * (max_item + RINGBUF_ITEM_HDR_SIZE - 3);
    buf_size_min &= ~((size_t)3); // align down to 4 bytes

    size_t total_payload = 0;
    if (off_acq == off_free && items_waiting == 0) {
        // Empty buffer: conservatively treat as a single large contiguous segment
        total_payload = p_uart_obj[uart_num]->tx_buf_size - RINGBUF_ITEM_HDR_SIZE;
    } else if (off_acq <= off_free) {
        // Single contiguous free segment
        size_t seg = (size_t)off_free - (size_t)off_acq;
        if (seg > RINGBUF_ITEM_HDR_SIZE) {
            size_t usable = seg - RINGBUF_ITEM_HDR_SIZE;
            usable &= ~((size_t)3);
            if (usable > max_item) {
                usable = max_item;
            }
            total_payload = usable;
        }
    } else {
        // Free space wraps: two segments [acq..tail) and [head..free)
        size_t seg1 = buf_size_min - (size_t)off_acq;
        size_t seg2 = (size_t)off_free; // from head (offset 0) to free
        size_t payload1 = 0;
        if (seg1 > RINGBUF_ITEM_HDR_SIZE) {
            size_t usable1 = seg1 - RINGBUF_ITEM_HDR_SIZE;
            usable1 &= ~((size_t)3);
            if (usable1 > max_item) {
                usable1 = max_item;
            }
            payload1 = usable1;
        }
        size_t payload2 = 0;
        if (seg2 > RINGBUF_ITEM_HDR_SIZE) {
            size_t usable2 = seg2 - RINGBUF_ITEM_HDR_SIZE;
            usable2 &= ~((size_t)3);
            if (usable2 > max_item) {
                usable2 = max_item;
            }
            payload2 = usable2;
        }
        total_payload = payload1 + payload2;
    }

    // Subtract the cost of the transaction's data description item (header + aligned struct)
    size_t desc_cost = RINGBUF_ITEM_HDR_SIZE + (((sizeof(uart_tx_data_t)) + 3) & ~((size_t)3));
    if (total_payload > desc_cost) {
        total_payload -= desc_cost;
    } else {
        total_payload = 0;
    }

    *size = total_payload;
    return ESP_OK;
}

