bdring/FluidNC/FluidNC/esp32/fnc_idf_uart_5_5_4.c
esp_err_t fnc_uart_detect_bitrate_stop(uart_port_t uart_num, bool deinit, fnc_uart_bitrate_res_t *ret_res)
{
    ESP_RETURN_ON_FALSE(uart_context[uart_num].hw_enabled && ret_res, ESP_ERR_INVALID_ARG, UART_TAG, "invalid arg");

    esp_err_t ret = ESP_OK;
    // For period count values, we will later add 1 to always over-count instead of under-count
    ret_res->low_period = uart_hal_get_low_pulse_cnt(&(uart_context[uart_num].hal));
    ret_res->high_period = uart_hal_get_high_pulse_cnt(&(uart_context[uart_num].hal));
    ret_res->pos_period = uart_hal_get_pos_pulse_cnt(&(uart_context[uart_num].hal));
    ret_res->neg_period = uart_hal_get_neg_pulse_cnt(&(uart_context[uart_num].hal));
    ret_res->edge_cnt = uart_hal_get_rxd_edge_cnt(&(uart_context[uart_num].hal));

    // stop auto baud rate detection
    uart_hal_set_autobaud_en(&(uart_context[uart_num].hal), false);

    const char *err_str = "";
    if (ret_res->low_period == 0 || ret_res->high_period == 0 || ret_res->pos_period == 0 || ret_res->neg_period == 0) {
        err_str = "fast";
    } else if (ret_res->low_period++ == UART_LL_PULSE_TICK_CNT_MAX || ret_res->high_period++ == UART_LL_PULSE_TICK_CNT_MAX || ret_res->pos_period++ == UART_LL_PULSE_TICK_CNT_MAX || ret_res->neg_period++ == UART_LL_PULSE_TICK_CNT_MAX) {
        err_str = "slow";
    }
    if (strcmp(err_str, "") != 0) {
        ESP_LOGW(UART_TAG, "bitrate too %s, unreliable xxx_period values, please try to adjust source_clk", err_str);
    }

    soc_module_clk_t src_clk;
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
    src_clk = SOC_MOD_CLK_APB; // On such targets, ticks are counted with APB clock, regardless the UART func clock sel
#else
    uart_hal_get_sclk(&(uart_context[uart_num].hal), &src_clk);
#endif
    ret = esp_clk_tree_src_get_freq_hz(src_clk, ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED, &ret_res->clk_freq_hz);
    if (ret != ESP_OK) {
        ESP_LOGE(UART_TAG, "unknown source_clk freq");
    }

    if (deinit) { // release the port
        fnc_uart_release_pin(uart_num, true, true, true, true);
        if (uart_num != CONFIG_ESP_CONSOLE_UART_NUM) {
            esp_clk_tree_enable_src(uart_context[uart_num].sclk_sel, false);
#if SOC_UART_SUPPORT_RTC_CLK
            if (src_clk == (soc_module_clk_t)UART_SCLK_RTC) {
                periph_rtc_dig_clk8m_disable();
            }
#endif
            uart_context[uart_num].sclk_sel = -1;
        }
        fnc_uart_module_disable(uart_num);
    }
    return ret;
}

void fnc_uart_set_data_callback(uart_port_t uart_num, uart_data_callback_t uart_data_callback) {
    if (uart_num < UART_NUM_MAX && p_uart_obj[uart_num]) {
        p_uart_obj[uart_num]->uart_data_callback = (uart_data_callback_t)uart_data_callback;
    }
}

#endif
